prickle/ESP32-Unified-Radio/src/bluetooth.cpp
//Shut down BT controller - called from audio thread
void stopBT() {
  esp_a2d_sink_deinit();
  esp_bluedroid_disable();
  esp_bluedroid_deinit();
  esp_bt_controller_disable();
  esp_bt_controller_deinit();
}

//Send volume change - called from audio thread
void BTvolchange(uint32_t vol) {
  btVolume = vol * 127.0f / 21.0f;
  if (btConnected && btVolNotify) {
    esp_avrc_rn_param_t rn_param;
    rn_param.volume = btVolume;
    esp_avrc_tg_send_rn_rsp(ESP_AVRC_RN_VOLUME_CHANGE, ESP_AVRC_RN_RSP_CHANGED, &rn_param);
    btVolNotify = false;
  }
}

//Send passthrough - called from audio thread
void BTpassthrough(uint8_t code, uint8_t state) {
  static uint8_t tl = 0;
  if (btConnected) {
    esp_avrc_ct_send_passthrough_cmd(tl, code, state);
    btPassNotify = false;
    tl = (tl + 1) % 16;
  }
}

/// Activates the rssi reporting
void BTsetRSSIActive(bool active) { rssiActive = active; }

/// Requests an update of the rssi delta value
bool BTupdateRssi() {
  if (rssiActive) esp_bt_gap_read_rssi_delta(peerAddress);
  return rssiActive;
}

bool BTconnect(esp_bd_addr_t peer) {
  esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
  esp_err_t err = esp_a2d_sink_connect(peer);
  if (err != ESP_OK) {
    log_e("esp_a2d_sink_connect:%d", err);
  }
  return err == ESP_OK;
}

bool BTdisconnect(esp_bd_addr_t peer) {
  esp_err_t status = esp_a2d_sink_disconnect(peer);
  if (status == ESP_FAIL) {
    log_e("esp_a2d_sink_disconnect:%d", status);
  }
  return status == ESP_OK;
}

//--------------------------------------------------------
// Callbacks

//BT Generic Access Profile
void bt_gap_cb(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param) {
  char buff[312];
  switch (event) {
    case ESP_BT_GAP_AUTH_CMPL_EVT: {
      if (param->auth_cmpl.stat == ESP_BT_STATUS_SUCCESS) {
        sprintf(buff, "GAP Authentication success: %s\r\n", param->auth_cmpl.device_name);
        btNotify(BT_TXT_EVENT, event, buff);
      } else {
        sprintf(buff, "GAP Authentication failed, status:%d\r\n", param->auth_cmpl.stat);
        btNotify(BT_TXT_EVENT, event, buff);
      }
      break;
    }
#if (CONFIG_BT_SSP_ENABLED == true)
    case ESP_BT_GAP_CFM_REQ_EVT:
      Serial.printf("ESP_BT_GAP_CFM_REQ_EVT Please compare the numeric value: %d\r\n", param->cfm_req.num_val);
      esp_bt_gap_ssp_confirm_reply(param->cfm_req.bda, true);
      break;
    case ESP_BT_GAP_KEY_NOTIF_EVT:
      Serial.printf("ESP_BT_GAP_KEY_NOTIF_EVT passkey:%d\r\n", param->key_notif.passkey);
      break;
    case ESP_BT_GAP_KEY_REQ_EVT:
      Serial.printf("ESP_BT_GAP_KEY_REQ_EVT Please enter passkey!\r\n");
      break;
#endif
    case ESP_BT_GAP_READ_RSSI_DELTA_EVT: {
      if (param->read_rssi_delta.stat == ESP_BT_STATUS_SUCCESS) {
        lastRSSI = param->read_rssi_delta.rssi_delta;
        btNotify(BT_RSSI_EVENT, lastRSSI + 128, "");
      }
      break;
    }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    case ESP_BT_GAP_READ_REMOTE_NAME_EVT: {
      if (param->read_rmt_name.stat == ESP_BT_STATUS_SUCCESS) {
        Serial.printf("ESP_BT_GAP_READ_REMOTE_NAME_EVT remote name:%s\r\n", param->read_rmt_name.rmt_name);
        memcpy(remoteName, param->read_rmt_name.rmt_name, ESP_BT_GAP_MAX_BDNAME_LEN);
        btNotify(BT_RNAME_EVENT, 0, remoteName);
      }
    } break;
#endif
    case ESP_BT_GAP_MODE_CHG_EVT:
      break;
    default: {
      Serial.printf("%s unhandled event %d\r\n", __func__, event);
      break;
    }
  }
}

//New track notification ack
static void bt_av_new_track(void)
{
    // request metadata
    uint8_t attr_mask = ESP_AVRC_MD_ATTR_TITLE | ESP_AVRC_MD_ATTR_ARTIST | ESP_AVRC_MD_ATTR_ALBUM | ESP_AVRC_MD_ATTR_GENRE;
    esp_avrc_ct_send_metadata_cmd(APP_RC_CT_TL_GET_META_DATA, attr_mask);

    // register notification if peer support the event_id
    if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST, &s_avrc_peer_rn_cap,
                                           ESP_AVRC_RN_TRACK_CHANGE)) {
        esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_TRACK_CHANGE, ESP_AVRC_RN_TRACK_CHANGE, 0);
    }
}

//Playback changed notification ack
static void bt_av_playback_changed(void)
{
    if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST, &s_avrc_peer_rn_cap,
                                           ESP_AVRC_RN_PLAY_STATUS_CHANGE)) {
        esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_PLAYBACK_CHANGE, ESP_AVRC_RN_PLAY_STATUS_CHANGE, 0);
    }
}

//Playback position notify ack
static void bt_av_play_pos_changed(void)
{
    if (esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST, &s_avrc_peer_rn_cap,
                                           ESP_AVRC_RN_PLAY_POS_CHANGED)) {
        esp_avrc_ct_send_register_notification_cmd(APP_RC_CT_TL_RN_PLAY_POS_CHANGE, ESP_AVRC_RN_PLAY_POS_CHANGED, 10);
    }
}

//BT Audio Video Remote Control Profile
void bt_rc_ct_cb(esp_avrc_ct_cb_event_t event, esp_avrc_ct_cb_param_t *param) {
  uint8_t* attr_text;
  switch (event) {
    case ESP_AVRC_CT_METADATA_RSP_EVT: 
      attr_text = (uint8_t *)malloc (param->meta_rsp.attr_length + 1);
      memcpy(attr_text, param->meta_rsp.attr_text, param->meta_rsp.attr_length);
      attr_text[param->meta_rsp.attr_length] = 0;
      btNotify(BT_META_EVENT, param->meta_rsp.attr_id, (char*)attr_text);
      break;
    case ESP_AVRC_CT_CONNECTION_STATE_EVT:
      if (param->conn_stat.connected) {
        esp_avrc_ct_send_get_rn_capabilities_cmd(APP_RC_CT_TL_GET_CAPS);
      } else {
        s_avrc_peer_rn_cap.bits = 0;
      }
      break;
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT:
      Serial.printf("AVRC passthrough rsp: key_code 0x%x, key_state %d\r\n",
               param->psth_rsp.key_code, param->psth_rsp.key_state);
      break;
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT: {
      //Serial.printf("AVRC remote features %x\r\n", param->rmt_feats.feat_mask);
      btRemoteFeaturesFlag = param->rmt_feats.tg_feat_flag;
      if ((param->rmt_feats.tg_feat_flag & ESP_AVRC_FEAT_FLAG_TG_COVER_ART)) {
        serial.println("> BT: Peer support Cover Art feature");
        // start the cover art connection
      }      
      break;
    }
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT:
        switch (param->change_ntf.event_id) {
        case ESP_AVRC_RN_TRACK_CHANGE:
          Serial.printf("ESP_AVRC_RN_TRACK_CHANGE\r\n");
          bt_av_new_track();
          break;
        case ESP_AVRC_RN_PLAY_STATUS_CHANGE:
          btNotify(BT_STATE_EVENT, param->change_ntf.event_parameter.playback, "");
          bt_av_playback_changed();
          break;
        case ESP_AVRC_RN_PLAY_POS_CHANGED:
          //Serial.printf("Play position changed: %d-ms\r\n",
          //        param->change_ntf.event_parameter.play_pos);
          btNotify(BT_POS_EVENT, param->change_ntf.event_parameter.play_pos, "");
          bt_av_play_pos_changed();
          break;

        default:
          Serial.printf("AVRC unhandled evt %d\r\n", param->change_ntf.event_id);
          break;
      }
      break;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT: {
      //Serial.printf("AVRC remote rn_cap: count %d, bitmask 0x%x\r\n",
      //         param->get_rn_caps_rsp.cap_count, param->get_rn_caps_rsp.evt_set.bits);
      s_avrc_peer_rn_cap.bits = param->get_rn_caps_rsp.evt_set.bits;
      bt_av_new_track();
      bt_av_playback_changed();
      bt_av_play_pos_changed();
      break;
    }

#endif

    default:
      Serial.printf("%s unhandled event %d", __func__, event);
      break;
  }
}

