prickle/ESP32-Unified-Radio/src/bluetooth.cpp
//BT Audio Video Remote Control Target Profile
void bt_rc_tg_cb(esp_avrc_tg_cb_event_t event, esp_avrc_tg_cb_param_t *param) {
  switch (event) {
  case ESP_AVRC_TG_CONNECTION_STATE_EVT: {
      break;
  }
  case ESP_AVRC_TG_PASSTHROUGH_CMD_EVT: {
      Serial.printf("AVRC passthrough cmd: key_code 0x%x, key_state %d\r\n", param->psth_cmd.key_code, param->psth_cmd.key_state);
      break;
  }
  case ESP_AVRC_TG_SET_ABSOLUTE_VOLUME_CMD_EVT: {
      btVolume = param->set_abs_vol.volume;
      btNotify(BT_VOL_EVENT, btVolume, "");
      break;
  }
  case ESP_AVRC_TG_REGISTER_NOTIFICATION_EVT: {
      if (param->reg_ntf.event_id == ESP_AVRC_RN_VOLUME_CHANGE) {
          btVolNotify = true;
          esp_avrc_rn_param_t rn_param;
          rn_param.volume = btVolume;
          esp_avrc_tg_send_rn_rsp(ESP_AVRC_RN_VOLUME_CHANGE, ESP_AVRC_RN_RSP_INTERIM, &rn_param);
      }
      break;
  }
  case ESP_AVRC_TG_REMOTE_FEATURES_EVT: {
      Serial.printf("AVRC remote features %x, CT features %x\r\n", param->rmt_feats.feat_mask, param->rmt_feats.ct_feat_flag);
      break;
  }
  default:
      Serial.printf("%s unhandled event %d\r\n", __func__, event);
      break;
  }

}

//BT Advanced Audio Distribution Profile Event
void bt_a2d_cb(esp_a2d_cb_event_t event, esp_a2d_cb_param_t *param)
{
  switch (event) {
  case ESP_A2D_CONNECTION_STATE_EVT: {
    if (btAutoConnect && param->conn_stat.state != ESP_A2D_CONNECTION_STATE_CONNECTING){
      btAutoTimeout = 0;
      btAutoRetry = 0;
    }
    if (param->conn_stat.state == ESP_A2D_CONNECTION_STATE_CONNECTED){
      memcpy(peerAddress, param->conn_stat.remote_bda, ESP_BD_ADDR_LEN);
      writePeerAddress(peerAddress);
      esp_bt_gap_set_scan_mode(ESP_BT_NON_CONNECTABLE, ESP_BT_NON_DISCOVERABLE);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
      // ask for the remote name
      esp_bt_gap_read_remote_name(param->conn_stat.remote_bda);
#endif
      // Get RSSI
      if (rssiActive) esp_bt_gap_read_rssi_delta(param->conn_stat.remote_bda);
    }
    else if (param->conn_stat.state == ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
      esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
      if (param->conn_stat.disc_rsn != ESP_A2D_DISC_RSN_NORMAL) {
        btAutoTimeout = millis() + BT_AUTOTIMER;
      }    
    }
    btNotify(BT_CONN_EVENT, param->conn_stat.state, "");
    break;
  }
  case ESP_A2D_AUDIO_STATE_EVT: {
    if (ESP_A2D_AUDIO_STATE_STARTED == param->audio_stat.state) {
      btConnected = true;
    } else if (ESP_A2D_AUDIO_STATE_STOPPED == param->audio_stat.state) {
      btConnected = false;
    }
    break;
  }
  case ESP_A2D_AUDIO_CFG_EVT: {
    //Serial.printf("> A2DP audio stream config, codec type %d\r\n", param->audio_cfg.mcc.type);
    // for now only SBC stream is supported
    if (param->audio_cfg.mcc.type == ESP_A2D_MCT_SBC) {
      int sample_rate = 16000;
      char oct0 = param->audio_cfg.mcc.cie.sbc[0];
      if (oct0 & (0x01 << 6)) sample_rate = 32000;
      else if (oct0 & (0x01 << 5)) sample_rate = 44100;
      else if (oct0 & (0x01 << 4)) sample_rate = 48000;
      btNotify(BT_SR_EVENT, sample_rate, "");
    }
    break;
  }
  case ESP_A2D_PROF_STATE_EVT:
    break;
  default:
    Serial.printf("%s unhandled event %d\r\n", __func__, event);
    break;
  }
}

//BT Advanced Audio Distribution Profile Data
void bt_data_cb(const uint8_t *data, uint32_t len){

  // number of 16 bit sample pairs l/r
  int n = len/4;
  // point to a 16bit sample 
  int16_t* data16=(int16_t*)data;
   
  for(int i=0;i<n;i++){
    // put the current sample in fy
    
    int16_t sample[2];

    sample[0] = (*data16++); // half Vin so we can boost up to 6dB in filters
    sample[1] = (*data16++);
    while (1) { if(playSample(sample)) break; }
    
  }
}
/*
//-------------------------------------------------------------------------------------
// Cover art

// @brief AVRCP cover art service control block structure
typedef struct {
    bool connected;                          // Connection status flag 
    bool getting;                            // Flag indicating if image is being retrieved 
    // Related to the image 
    uint8_t image_hdl_old[7];                // Previous image handle, used to detect image changes 
    uint32_t image_size;                     // Size of the image data in bytes 
    uint8_t *image_data;                     // Pointer to the image data buffer 
    bool image_final;                        // Indicate whether the image reception has been completed 
} avrc_ca_service_cb_t;

static bool avrc_ca_handleCheck(uint8_t *image_handle, int len);
static void avrc_ca_freeImageData(void);

// avrcp cover art service control block
static avrc_ca_service_cb_t avrc_ca_serviceControlBlock;

static void avrc_ca_freeImageData(void)
{
    if (avrc_ca_serviceControlBlock.image_data) {
        free(avrc_ca_serviceControlBlock.image_data);
        avrc_ca_serviceControlBlock.image_data = NULL;
    }
    avrc_ca_serviceControlBlock.image_size = 0;
}

static void avrc_ca_imageReady(void)
{
    Serial.println("> BT JPEG image ready.");

}

void avrc_ca_open(void)
{
    memset(&avrc_ca_serviceControlBlock, 0, sizeof(avrc_ca_service_cb_t));
}

void avrc_ca_close(void)
{
    avrc_ca_freeImageData();
    memset(&avrc_ca_serviceControlBlock, 0, sizeof(avrc_ca_service_cb_t));
}

bool btc_avrc_ct_check_cover_art_support(void)
{
    return (btRemoteFeaturesFlag & ESP_AVRC_FEAT_FLAG_TG_COVER_ART);
}


esp_err_t esp_avrc_ct_cover_art_connect(uint16_t mtu)
{
    if (esp_bluedroid_get_status() != ESP_BLUEDROID_STATUS_ENABLED){
        return ESP_ERR_INVALID_STATE;
    }

    if (!btc_avrc_ct_check_cover_art_support()) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    btc_msg_t msg;
    msg.sig = BTC_SIG_API_CALL;
    msg.pid = BTC_PID_AVRC_CT;
    msg.act = BTC_AVRC_CT_API_COVER_ART_CONNECT_EVT;

    btc_avrc_args_t arg;
    memset(&arg, 0, sizeof(btc_avrc_args_t));
    arg.ca_conn.mtu = mtu;

    // Switch to BTC context 
    bt_status_t stat = btc_transfer_context(&msg, &arg, sizeof(btc_avrc_args_t), NULL, NULL);
    return (stat == BT_STATUS_SUCCESS) ? ESP_OK : ESP_FAIL;
}

esp_err_t esp_avrc_ct_cover_art_disconnect(void)
{
    if (esp_bluedroid_get_status() != ESP_BLUEDROID_STATUS_ENABLED) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!btc_avrc_ct_check_cover_art_support()) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    btc_msg_t msg;
    msg.sig = BTC_SIG_API_CALL;
    msg.pid = BTC_PID_AVRC_CT;
    msg.act = BTC_AVRC_CT_API_COVER_ART_DISCONNECT_EVT;

    // Switch to BTC context
    bt_status_t stat = btc_transfer_context(&msg, NULL, 0, NULL, NULL);
    return (stat == BT_STATUS_SUCCESS) ? ESP_OK : ESP_FAIL;
}

esp_err_t esp_avrc_ct_cover_art_get_image_properties(uint8_t *image_handle)
{
    if ((esp_bluedroid_get_status() != ESP_BLUEDROID_STATUS_ENABLED) ||
        (!btc_avrc_ct_connected_p())) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!btc_avrc_ct_check_cover_art_support()) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (image_handle == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    btc_msg_t msg;
    msg.sig = BTC_SIG_API_CALL;
    msg.pid = BTC_PID_AVRC_CT;
    msg.act = BTC_AVRC_CT_API_COVER_ART_GET_IMAGE_PROPERTIES_EVT;

    btc_avrc_args_t arg;
    memset(&arg, 0, sizeof(btc_avrc_args_t));
    memcpy(arg.ca_get_img_prop.image_handle, image_handle, ESP_AVRC_CA_IMAGE_HANDLE_LEN);

    // Switch to BTC context
    bt_status_t stat = btc_transfer_context(&msg, &arg, sizeof(btc_avrc_args_t), NULL, NULL);
    return (stat == BT_STATUS_SUCCESS) ? ESP_OK : ESP_FAIL;
}

esp_err_t esp_avrc_ct_cover_art_get_image(uint8_t *image_handle, uint8_t *image_descriptor, uint16_t image_descriptor_len)
{
    if ((esp_bluedroid_get_status() != ESP_BLUEDROID_STATUS_ENABLED) ||
        (!btc_avrc_ct_connected_p())) {
        return ESP_ERR_INVALID_STATE;
    }

    if (!btc_avrc_ct_check_cover_art_support()) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (image_handle == NULL || image_descriptor == NULL || image_descriptor_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    btc_msg_t msg;
    msg.sig = BTC_SIG_API_CALL;
    msg.pid = BTC_PID_AVRC_CT;
    msg.act = BTC_AVRC_CT_API_COVER_ART_GET_IMAGE_EVT;

    btc_avrc_args_t arg;
    memset(&arg, 0, sizeof(btc_avrc_args_t));

    memcpy(arg.ca_get_img.image_handle, image_handle, ESP_AVRC_CA_IMAGE_HANDLE_LEN);
    arg.ca_get_img.image_descriptor_len = image_descriptor_len;
    arg.ca_get_img.image_descriptor = image_descriptor;

    // Switch to BTC context
    bt_status_t stat = btc_transfer_context(&msg, &arg, sizeof(btc_avrc_args_t), btc_avrc_arg_deep_copy, btc_avrc_arg_deep_free);
    return (stat == BT_STATUS_SUCCESS) ? ESP_OK : ESP_FAIL;
}



void avrc_cover_art_srv_connect(uint16_t mtu)
{
    if (!avrc_ca_serviceControlBlock.connected) {
        serial.println("> BT Start cover art connection...");
        // start the cover art connection
        esp_avrc_ct_cover_art_connect(mtu);
    }
}

void avrc_cover_art_srv_set_image_final(bool final)
{
    s_avrc_cover_art_srv_cb.image_final = final;
    if (s_avrc_cover_art_srv_cb.image_final) {
        ESP_LOGI(RC_CA_SRV_TAG, "Cover Art Client final data event, image size: %lu bytes", s_avrc_cover_art_srv_cb.image_size);

        // decode and display the image 
        avrc_cover_art_srv_decode_image();
        // display the image 
        avrc_cover_art_srv_display_image();
        // set the getting state to false, we can get next image now 
        s_avrc_cover_art_srv_cb.getting = false;
    }
}

